# See https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
#
# Usage:
#     brew tap homebrew/bundle
#     brew bundle

# Taps (https://docs.brew.sh/brew-tap.html)
tap 'caskroom/cask' # https://caskroom.github.io/
tap 'caskroom/versions' # https://github.com/caskroom/homebrew-versions

# TODO: Cleanup deprecated taps. Might need to do this manually.
# untap 'homebrew/binary'   # deprecated per https://github.com/Homebrew/homebrew-binary
# untap 'homebrew/boneyard' # deprecated per https://github.com/Homebrew/homebrew-boneyard
# untap 'homebrew/dupes'    # deprecated per https://github.com/Homebrew/homebrew-dupes
# untap 'homebrew/games'    # deprecated per https://github.com/Homebrew/homebrew-games
# untap 'homebrew/versions' # deprecated per https://github.com/Homebrew/homebrew-versions

# Homebrew
brew 'autojump'
brew 'curl'
brew 'ffmpeg'
brew 'git'
brew 'git-lfs'
brew 'gpg'
brew 'graphviz'
brew 'gron'
# brew 'highlight'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'lnav'
brew 'mas'
# brew 'mitmproxy'
# brew 'mysql'
# brew 'nginx'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'ripgrep'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'tree'
brew 'wget'
brew 'yarn'

brew 'gibo' # https://github.com/simonwhitaker/gibo, https://github.com/github/gitignore
brew 'bundler-completion'
brew 'docker-completion'
brew 'gem-completion'
brew 'rails-completion'
brew 'rake-completion'
brew 'ruby-completion'

# Mac App Store
# ids from `mas list`
mas 'Caffeine', id: 411246225
mas 'Kindle', id: 405399194
mas 'LastPass', id: 926036361
mas 'Mactracker', id: 430255202
mas 'Pixelmator', id: 407963104
mas 'Xcode', id: 497799835

# Cask
cask 'atom'
# cask 'dbeaver-community'
# cask 'dotnet-sdk'
# cask 'etcher'
# cask 'firefox'
# cask 'gimp'
# cask 'google-chrome'
# cask 'inkscape'
cask 'iterm2'
# cask 'java'
# cask 'keycastr'
# cask 'mysqlworkbench'
# cask 'pgadmin4'
# cask 'sdformatter'
# cask 'sketchup'
# cask 'sonic-pi'
# cask 'transmission'
# cask 'virtualbox'
cask 'vlc'
# cask 'vnc-viewer'
